institute-mpsu-miet/uos_embedded/runtime/cortex-m/io-stm32l.h
// AHBENR values
#define RCC_FSMCEN              (1 << 30)
#define RCC_AESEN               (1 << 27)
#define RCC_DMA2EN              (1 << 25)
#define RCC_DMA1EN              (1 << 24)
#define RCC_FLITFEN             (1 << 15)
#define RCC_CRCEN               (1 << 12)
#define RCC_GPIOGEN             (1 << 7)
#define RCC_GPIOFEN             (1 << 6)
#define RCC_GPIOHEN             (1 << 5)
#define RCC_GPIOEEN             (1 << 4)
#define RCC_GPIODEN             (1 << 3)
#define RCC_GPIOCEN             (1 << 2)
#define RCC_GPIOBEN             (1 << 1)
#define RCC_GPIOAEN             (1 << 0)

// APB2ENR values
#define RCC_USART1EN           (1 << 14)
#define RCC_SPI1EN             (1 << 12)
#define RCC_SDIOEN             (1 << 11)
#define RCC_ADC1EN             (1 << 9)
#define RCC_TIM11EN            (1 << 4)
#define RCC_TIM10EN            (1 << 3)
#define RCC_TIM9EN             (1 << 2)
#define RCC_SYSCFGEN           (1 << 0)

// APB1ENR values
#define RCC_COMPEN             (1 << 31)
#define RCC_DACEN              (1 << 29)
#define RCC_PWREN              (1 << 28)
#define RCC_USBEN              (1 << 23)
#define RCC_I2C2EN             (1 << 22)
#define RCC_I2C1EN             (1 << 21)
#define RCC_UART5EN            (1 << 20)
#define RCC_UART4EN            (1 << 19)
#define RCC_USART3EN           (1 << 18)
#define RCC_USART2EN           (1 << 17)
#define RCC_SPI3EN             (1 << 15)
#define RCC_SPI2EN             (1 << 14)
#define RCC_WWDGEN             (1 << 11)
#define RCC_LCDEN              (1 << 9)
#define RCC_TIM7EN             (1 << 5)
#define RCC_TIM6EN             (1 << 4)
#define RCC_TIM5EN             (1 << 3)
#define RCC_TIM4EN             (1 << 2)
#define RCC_TIM3EN             (1 << 1)
#define RCC_TIM2EN             (1 << 0)

// AHBLPENR values
#define RCC_FSMCLPEN           (1 << 30)
#define RCC_AESLPEN            (1 << 27)
#define RCC_DMA2LPEN           (1 << 25)
#define RCC_DMA1LPEN           (1 << 24)
#define RCC_SRAMLPEN           (1 << 16)
#define RCC_FLITFLPEN          (1 << 15)
#define RCC_CRCLPEN            (1 << 12)
#define RCC_GPIOGLPEN          (1 << 7)
#define RCC_GPIOFLPEN          (1 << 6)
#define RCC_GPIOHLPEN          (1 << 5)
#define RCC_GPIOELPEN          (1 << 4)
#define RCC_GPIODLPEN          (1 << 3)
#define RCC_GPIOCLPEN          (1 << 2)
#define RCC_GPIOBLPEN          (1 << 1)
#define RCC_GPIOALPEN          (1 << 0)

// APB2LPENR values
#define RCC_USART1LPEN         (1 << 14)
#define RCC_SPI1LPEN           (1 << 12)
#define RCC_SDIOLPEN           (1 << 11)
#define RCC_ADC1LPEN           (1 << 9)
#define RCC_TIM11LPEN          (1 << 4)
#define RCC_TIM10LPEN          (1 << 3)
#define RCC_TIM9LPEN           (1 << 2)
#define RCC_SYSCFGLPEN         (1 << 0)

// APB1LPENR values
#define RCC_COMPLPEN           (1 << 31)
#define RCC_DACLPEN            (1 << 29)
#define RCC_PWRLPEN            (1 << 28)
#define RCC_USBLPEN            (1 << 23)
#define RCC_I2C2LPEN           (1 << 22)
#define RCC_I2C1LPEN           (1 << 21)
#define RCC_UART5LPEN          (1 << 20)
#define RCC_UART4LPEN          (1 << 19)
#define RCC_USART3LPEN         (1 << 18)
#define RCC_USART2LPEN         (1 << 17)
#define RCC_SPI3LPEN           (1 << 15)
#define RCC_SPI2LPEN           (1 << 14)
#define RCC_WWDGLPEN           (1 << 11)
#define RCC_LCDLPEN            (1 << 9)
#define RCC_TIM7LPEN           (1 << 5)
#define RCC_TIM6LPEN           (1 << 4)
#define RCC_TIM5LPEN           (1 << 3)
#define RCC_TIM4LPEN           (1 << 2)
#define RCC_TIM3LPEN           (1 << 1)
#define RCC_TIM2LPEN           (1 << 0)

// CSR values
#define RCC_LPWRRSTF            (1 << 31)
#define RCC_WWDGRSTF            (1 << 30)
#define RCC_IWDGRSTF            (1 << 29)
#define RCC_SFTRSTF             (1 << 28)
#define RCC_PORRSTF             (1 << 27)
#define RCC_PINRSTF             (1 << 26)
#define RCC_OBLRSTF             (1 << 25)
#define RCC_RMVF                (1 << 24)
#define RCC_RTCRST              (1 << 23)
#define RCC_RTCEN               (1 << 22)
#define RCC_RTCSEL_NO_CLK       (0 << 16)
#define RCC_RTCSEL_LSE          (1 << 16)
#define RCC_RTCSEL_LSI          (2 << 16)
#define RCC_RTCSEL_HSE          (3 << 16)
#define RCC_LSECSSD             (1 << 12)
#define RCC_LSECSSON            (1 << 11)
#define RCC_LSEBYP              (1 << 10)
#define RCC_LSERDY              (1 << 9)
#define RCC_LSEON               (1 << 8)
#define RCC_LSIRDY              (1 << 1)
#define RCC_LSION               (1 << 0)


/////////////////////////////////////////
// Flash interface
/////////////////////////////////////////
typedef struct
{
    arm_reg_t ACR;      // Access control
    arm_reg_t PECR;     // Program/erase control
    arm_reg_t PDKEYR;   // Power down key
    arm_reg_t PEKEYR;   // Program/erase key
    arm_reg_t PRGKEYR;  // Program memory key
    arm_reg_t OPTKEYR;  // Option byte key
    arm_reg_t SR;       // Status
    arm_reg_t OBR;      // Option byte
    arm_reg_t WRPR1;    // Write protection
    arm_reg_t WRPR2;    // Write protection
    arm_reg_t WRPR3;    // Write protection
    arm_reg_t WRPR4;    // Write protection
} FLASH_t;

#define FLASH     ((FLASH_t*) STM_FLASH_IFACE_BASE)

// ACR values
#define FLASH_RUN_PD            (1 << 4)
#define FLASH_SLEEP_PD          (1 << 3)
#define FLASH_ACC64             (1 << 2)
#define FLASH_PRFTEN            (1 << 1)
#define FLASH_LATENCY(n)        (n)

// PECR values
#define FLASH_OBL_LAUNCH        (1 << 18)
#define FLASH_ERRIE             (1 << 17)
#define FLASH_EOPIE             (1 << 16)
#define FLASH_PARALLBANK        (1 << 15)
#define FLASH_FPRG              (1 << 10)
#define FLASH_ERASE             (1 << 9)
#define FLASH_FTDW              (1 << 8)
#define FLASH_DATA              (1 << 4)
#define FLASH_PROG              (1 << 3)
#define FLASH_OPTLOCK           (1 << 2)
#define FLASH_PRGLOCK           (1 << 1)
#define FLASH_PELOCK            (1 << 0)

// PDKEYR values
#define FLASH_PDKEY1            0x04152637
#define FLASH_PDKEY2            0xFAFBFCFD

