institute-mpsu-miet/uos_embedded/runtime/cortex-m/io-stm32l.h
// PEKEYR values
#define FLASH_PEKEY1            0x89ABCDEF
#define FLASH_PEKEY2            0x02030405

// PRGKEYR values
#define FLASH_PRGKEY1           0x8C9DAEBF
#define FLASH_PRGKEY2           0x13141516

// OPTKEYR values
#define FLASH_OPTKEY1           0xFBEAD9C8
#define FLASH_OPTKEY2           0x24252627

// SR values
#define FLASH_RDERR             (1 << 13)
#define FLASH_OPTVERRUSR        (1 << 12)
#define FLASH_OPTVERR           (1 << 11)
#define FLASH_SIZERR            (1 << 10)
#define FLASH_PGAERR            (1 << 9)
#define FLASH_WRPERR            (1 << 8)
#define FLASH_ERR_MASK          (0x1F << 8)
#define FLASH_READY             (1 << 3)
#define FLASH_ENDHV             (1 << 2)
#define FLASH_EOP               (1 << 1)
#define FLASH_BSY               (1 << 0)

// OBR values
#define FLASH_nBFB2             (1 << 23)
#define FLASH_nRST_STDBY        (1 << 22)
#define FLASH_nRST_STOP         (1 << 21)
#define FLASH_IWDG_SW           (1 << 20)
#define FLASH_BOR_OFF           (0 << 19)
#define FLASH_BOR_OFF_MASK      (1 << 19)
#define FLASH_BOR_LEVEL_MASK    (0xF << 16)
#define FLASH_BOR_LEVEL1        (0x8 << 16)
#define FLASH_BOR_LEVEL2        (0x9 << 16)
#define FLASH_BOR_LEVEL3        (0xA << 16)
#define FLASH_BOR_LEVEL4        (0xB << 16)
#define FLASH_BOR_LEVEL5        (0xC << 16)
#define FLASH_SPRMOD            (1 << 8)
#define FLASH_RDPRT_LEVEL0      0xAA
#define FLASH_RDPRT_LEVEL2      0xCC


/////////////////////////////////////////
// Option bytes
/////////////////////////////////////////
typedef struct
{
    arm_reg_t RDP;
    arm_reg_t USER;
    arm_reg_t WRP01;
    arm_reg_t WRP23;
    arm_reg_t WRP45;
    arm_reg_t WRP67;
    arm_reg_t WRP89;
    arm_reg_t WRP1011;
} OB_t;

#define OB     ((OB_t*) STM_OB_BASE)

// RDP values
#define OB_RDP_ALWAYS_ONES      0xFE000000
#define OB_nSPRMOD              (1 << 24)
#define OB_nRDP(x)              ((x) << 16)
#define OB_RDP_ALWAYS_ZEROES    0x0000FE00
#define OB_SPRMOD               (1 << 8)
#define OB_RDP_LEVEL0           0xAA
#define OB_RDP_LEVEL2           0xCC

// USER values
// nUSER field
#define OB_BFB2                 (1 << 23)
#define OB_RST_STDBY            (1 << 22)
#define OB_RST_STOP             (1 << 21)
#define OB_nIWDG_SW             (1 << 20)
#define OB_nBOR_OFF             (1 << 19)
#define OB_nBOR_OFF_MASK        (1 << 19)
#define OB_nBOR_LEVEL_MASK      (0xF << 16)
#define OB_nBOR_LEVEL1          (0x7 << 16)
#define OB_nBOR_LEVEL2          (0x6 << 16)
#define OB_nBOR_LEVEL3          (0x5 << 16)
#define OB_nBOR_LEVEL4          (0x4 << 16)
#define OB_nBOR_LEVEL5          (0x3 << 16)
// USER field
#define OB_nBFB2                (1 << 7)
#define OB_nRST_STDBY           (1 << 6)
#define OB_nRST_STOP            (1 << 5)
#define OB_IWDG_SW              (1 << 4)
#define OB_BOR_OFF              (0 << 3)
#define OB_BOR_OFF_MASK         (1 << 3)
#define OB_BOR_LEVEL_MASK       (0xF << 0)
#define OB_BOR_LEVEL1           (0x8 << 0)
#define OB_BOR_LEVEL2           (0x9 << 0)
#define OB_BOR_LEVEL3           (0xA << 0)
#define OB_BOR_LEVEL4           (0xB << 0)
#define OB_BOR_LEVEL5           (0xC << 0)


/////////////////////////////////////////
// CRC calculation
/////////////////////////////////////////
typedef struct
{
    arm_reg_t DR;    // Data
    arm_reg_t IDR;   // Independent data
    arm_reg_t CR;    // Control
} CRC_t;

#define CRC         ((CRC_t*) STM_CRC_BASE)

// CRC_CR values
#define CRC_RESET       (1 << 0)


/////////////////////////////////////////
// General purpose I/O
/////////////////////////////////////////
typedef struct
{
    arm_reg_t MODER;    // Mode
    arm_reg_t OTYPER;   // Output type
    arm_reg_t OSPEEDR;  // Output speed
    arm_reg_t PUPDR;    // Pull-up/pull-down
    arm_reg_t IDR;      // Input data
    arm_reg_t ODR;      // Output data
    arm_reg_t BSRR;     // Bit set/reset
    arm_reg_t LCKR;     // Configuration lock
    arm_reg_t AFRL;     // Alternate function low register
    arm_reg_t AFRH;     // Alternate function high register
    arm_reg_t BRR;      // Bit reset (Cat. 3,4,5,6 only)
} GPIO_t;

#define GPIOA       ((GPIO_t*) STM_GPIOA_BASE)
#define GPIOB       ((GPIO_t*) STM_GPIOB_BASE)
#define GPIOC       ((GPIO_t*) STM_GPIOC_BASE)
#define GPIOD       ((GPIO_t*) STM_GPIOD_BASE)
#define GPIOE       ((GPIO_t*) STM_GPIOE_BASE)
#define GPIOF       ((GPIO_t*) STM_GPIOF_BASE)
#define GPIOG       ((GPIO_t*) STM_GPIOG_BASE)
#define GPIOH       ((GPIO_t*) STM_GPIOH_BASE)
#define GPIOI       ((GPIO_t*) STM_GPIOI_BASE)

// MODER values
#define GPIO_IN(n)          (0 << (2 * n))  // Input mode
#define GPIO_OUT(n)         (1 << (2 * n))  // General purpose output mode
#define GPIO_ALT(n)         (2 << (2 * n))  // Alternate function mode
#define GPIO_ANA(n)         (3 << (2 * n))  // Analog mode
#define GPIO_MODE_MASK(n)   (3 << (2 * n))  // Mask

// OTYPER values
#define GPIO_PP(n)      (0 << (n))      // Push-pull
#define GPIO_OD(n)      (1 << (n))      // Open drain

// OSPEEDR values
#define GPIO_2MHz(n)        (0 << (2 * n))  // Low speed
#define GPIO_25MHz(n)       (1 << (2 * n))  // Medium speed
#define GPIO_50MHz(n)       (2 << (2 * n))  // Fast speed
#define GPIO_100MHz(n)      (3 << (2 * n))  // High speed
#define GPIO_OSPEED_MASK(n) (3 << (2 * n))  // Field mask

// PUPDR values
#define GPIO_NO_PULL(n)   (0 << (2 * n))  // No pull-up, no pull-down
#define GPIO_PULL_UP(n)   (1 << (2 * n))  // Pull-up
#define GPIO_PULL_DOWN(n) (2 << (2 * n))  // Pull-down

// BSRR values
#define GPIO_SET(n)     (1 << (n))      // Atomic set n-th bit of ODR
#define GPIO_RESET(n)   (1 << (n + 16)) // Atomic reset n-th bit of ODR

// LCKR values
#define GPIO_LCK(n)     (1 << (n))      // Pin configuration lock
#define GPIO_LCKK(n)    (1 << 16)       // Port configuration lock key

// Alternate functions (AFRL and AFRH values)
#define GPIO_AF_SYSTEM(n)   (0x0 << (4 * ((n) & 7)))
#define GPIO_AF_TIM1(n)     (0x1 << (4 * ((n) & 7)))
#define GPIO_AF_TIM2(n)     (0x1 << (4 * ((n) & 7)))
#define GPIO_AF_TIM3(n)     (0x2 << (4 * ((n) & 7)))
#define GPIO_AF_TIM4(n)     (0x2 << (4 * ((n) & 7)))
#define GPIO_AF_TIM5(n)     (0x2 << (4 * ((n) & 7)))
#define GPIO_AF_TIM8(n)     (0x3 << (4 * ((n) & 7)))
#define GPIO_AF_TIM9(n)     (0x3 << (4 * ((n) & 7)))
#define GPIO_AF_TIM10(n)    (0x3 << (4 * ((n) & 7)))
#define GPIO_AF_TIM11(n)    (0x3 << (4 * ((n) & 7)))
#define GPIO_AF_I2C1(n)     (0x4 << (4 * ((n) & 7)))
#define GPIO_AF_I2C2(n)     (0x4 << (4 * ((n) & 7)))
#define GPIO_AF_I2C3(n)     (0x4 << (4 * ((n) & 7)))
#define GPIO_AF_SPI1(n)     (0x5 << (4 * ((n) & 7)))
#define GPIO_AF_SPI2(n)     (0x5 << (4 * ((n) & 7)))
#define GPIO_AF_SPI3(n)     (0x6 << (4 * ((n) & 7)))
#define GPIO_AF_USART1(n)   (0x7 << (4 * ((n) & 7)))
#define GPIO_AF_USART2(n)   (0x7 << (4 * ((n) & 7)))
#define GPIO_AF_USART3(n)   (0x7 << (4 * ((n) & 7)))
#define GPIO_AF_USART4(n)   (0x8 << (4 * ((n) & 7)))
#define GPIO_AF_USART5(n)   (0x8 << (4 * ((n) & 7)))
#define GPIO_AF_USART6(n)   (0x8 << (4 * ((n) & 7)))
#define GPIO_AF_CAN1(n)     (0x9 << (4 * ((n) & 7)))
#define GPIO_AF_CAN2(n)     (0x9 << (4 * ((n) & 7)))
#define GPIO_AF_TIM12(n)    (0x9 << (4 * ((n) & 7)))
#define GPIO_AF_TIM13(n)    (0x9 << (4 * ((n) & 7)))
#define GPIO_AF_TIM14(n)    (0x9 << (4 * ((n) & 7)))
#define GPIO_AF_OTG_FS(n)   (0xA << (4 * ((n) & 7)))
#define GPIO_AF_OTG_HS(n)   (0xA << (4 * ((n) & 7)))
#define GPIO_AF_ETH(n)      (0xB << (4 * ((n) & 7)))
#define GPIO_AF_FSMC(n)     (0xC << (4 * ((n) & 7)))
#define GPIO_AF_SDIO(n)     (0xC << (4 * ((n) & 7)))
#define GPIO_AF_OTG_HS_FS(n) (0xC << (4 * ((n) & 7)))
#define GPIO_AF_DCMI(n)     (0xD << (4 * ((n) & 7)))
#define GPIO_AF_EVENTOUT(n) (0xF << (4 * ((n) & 7)))
#define GPIO_AF_MASK(n)     (0xF << (4 * ((n) & 7)))


/////////////////////////////////////////
// SYSCFG
/////////////////////////////////////////
typedef struct
{
    arm_reg_t MEMRMP;   // memory remap
    arm_reg_t PMC;      // peripheral mode configuration
    arm_reg_t EXTICR1;  // external interrupt configuration 1
    arm_reg_t EXTICR2;  // external interrupt configuration 2
    arm_reg_t EXTICR3;  // external interrupt configuration 3
    arm_reg_t EXTICR4;  // external interrupt configuration 4
} SYSCFG_t;

