institute-mpsu-miet/uos_embedded/runtime/cortex-m/io-stm32l.h
#define SYSCFG      ((SYSCFG_t*) STM_SYSCFG_BASE)

// SYSCFG_MEMRMP values
#define SYSCFG_BOOT_MAIN_FLASH      (0 << 8)
#define SYSCFG_BOOT_SYSTEM_FLASH    (1 << 8)
#define SYSCFG_BOOT_EMB_SRAM        (3 << 8)
#define SYSCFG_MEM_MAIN_FLASH       (0 << 8)
#define SYSCFG_MEM_SYSTEM_FLASH     (1 << 8)
#define SYSCFG_MEM_FSMC             (2 << 8)
#define SYSCFG_MEM_SRAM             (3 << 8)

// SYSCFG_PMC values
#define SYSCFG_LCD_CAPA_PE12        (1 << 5)
#define SYSCFG_LCD_CAPA_PE11        (1 << 4)
#define SYSCFG_LCD_CAPA_PB0         (1 << 3)
#define SYSCFG_LCD_CAPA_PB12        (1 << 2)
#define SYSCFG_LCD_CAPA_PB2         (1 << 1)
#define SYSCFG_USB_PU               (1 << 0)

// SYSCFG_EXTICRx values
#define SYSCFG_PA(x)                (0 << (((x) & 3) * 4))
#define SYSCFG_PB(x)                (1 << (((x) & 3) * 4))
#define SYSCFG_PC(x)                (2 << (((x) & 3) * 4))
#define SYSCFG_PD(x)                (3 << (((x) & 3) * 4))
#define SYSCFG_PE(x)                (4 << (((x) & 3) * 4))
#define SYSCFG_PH(x)                (5 << (((x) & 3) * 4))
#define SYSCFG_PF(x)                (6 << (((x) & 3) * 4))
#define SYSCFG_PG(x)                (7 << (((x) & 3) * 4))
#define SYSCFG_PMASK(x)             (0xF << (((x) & 3) * 4))


/////////////////////////////////////////
// ADC
/////////////////////////////////////////
typedef struct
{
    arm_reg_t SR;       // status
    arm_reg_t CR1;      // control 1
    arm_reg_t CR2;      // control 2
    arm_reg_t SMPR1;    // sample time 1
    arm_reg_t SMPR2;    // sample time 2
    arm_reg_t SMPR3;    // sample time 3
    arm_reg_t JOFR1;    // injected channel data offset 1
    arm_reg_t JOFR2;    // injected channel data offset 2
    arm_reg_t JOFR3;    // injected channel data offset 3
    arm_reg_t JOFR4;    // injected channel data offset 4
    arm_reg_t HTR;      // watchdog higher threshold
    arm_reg_t LTR;      // watchdog lower threshold
    arm_reg_t SQR1;     // regular sequence 1
    arm_reg_t SQR2;     // regular sequence 2
    arm_reg_t SQR3;     // regular sequence 3
    arm_reg_t SQR4;     // regular sequence 4
    arm_reg_t SQR5;     // regular sequence 5
    arm_reg_t JSQR;     // injected sequence
    arm_reg_t JDR1;     // injected data 1
    arm_reg_t JDR2;     // injected data 2
    arm_reg_t JDR3;     // injected data 3
    arm_reg_t JDR4;     // injected data 4
    arm_reg_t DR;       // regular data
    arm_reg_t SMPR0;    // sample time 0
    arm_reg_t gap0[168];
    arm_reg_t CSR;      // common status
    arm_reg_t CCR;      // common control
} ADC_t;

#define ADC   ((ADC_t*) STM_ADC_BASE)

// ADC_SR
#define ADC_JCNR                (1 << 9)
#define ADC_RCNR                (1 << 8)
#define ADC_ADONS               (1 << 6)
#define ADC_OVR                 (1 << 5)
#define ADC_STRT                (1 << 4)
#define ADC_JSTRT               (1 << 3)
#define ADC_JEOC                (1 << 2)
#define ADC_EOC                 (1 << 1)
#define ADC_AWD                 (1 << 0)

// ADC_CR1
#define ADC_OVRIE               (1 << 26)
#define ADC_RES_12BIT           (0 << 24)
#define ADC_RES_10BIT           (1 << 24)
#define ADC_RES_8BIT            (2 << 24)
#define ADC_RES_6BIT            (3 << 24)
#define ADC_AWDEN               (1 << 23)
#define ADC_JAWDEN              (1 << 22)
#define ADC_PDI                 (1 << 17)
#define ADC_PDD                 (1 << 16)
#define ADC_DISCNUM(n)          ((n) << 13)
#define ADC_JDISCEN             (1 << 12)
#define ADC_DISCEN              (1 << 11)
#define ADC_JAUTO               (1 << 10)
#define ADC_AWDSGL              (1 << 9)
#define ADC_SCAN                (1 << 8)
#define ADC_JOECIE              (1 << 7)
#define ADC_AWDIE               (1 << 6)
#define ADC_OECIE               (1 << 5)
#define ADC_AWDCH(n)            ((n) & 0x1F)

// ADC_CR2
#define ADC_SWSTART             (1 << 30)
#define ADC_EXTEN_DISABLE       (0 << 28)
#define ADC_EXTEN_RISING        (1 << 28)
#define ADC_EXTEN_FALLING       (2 << 28)
#define ADC_EXTEN_BOTH          (3 << 28)
#define ADC_EXTSEL_TIM9_CC2     (0 << 24)
#define ADC_EXTSEL_TIM9_TRGO    (1 << 24)
#define ADC_EXTSEL_TIM2_CC3     (2 << 24)
#define ADC_EXTSEL_TIM2_CC2     (3 << 24)
#define ADC_EXTSEL_TIM3_TRGO    (4 << 24)
#define ADC_EXTSEL_TIM4_CC4     (5 << 24)
#define ADC_EXTSEL_TIM2_TRGO    (6 << 24)
#define ADC_EXTSEL_TIM3_CC1     (7 << 24)
#define ADC_EXTSEL_TIM3_CC3     (8 << 24)
#define ADC_EXTSEL_TIM4_TRGO    (9 << 24)
#define ADC_EXTSEL_TIM6_TRGO    (10 << 24)
#define ADC_EXTSEL_EXTI11       (15 << 24)
#define ADC_JSWSTART            (1 << 22)
#define ADC_JEXTEN_DISABLE      (0 << 20)
#define ADC_JEXTEN_RISING       (1 << 20)
#define ADC_JEXTEN_FALLING      (2 << 20)
#define ADC_JEXTEN_BOTH         (3 << 20)
#define ADC_JEXTSEL_TIM9_CC1    (0 << 16)
#define ADC_JEXTSEL_TIM9_TRGO   (1 << 16)
#define ADC_JEXTSEL_TIM2_TRGO   (2 << 16)
#define ADC_JEXTSEL_TIM2_CC1    (3 << 16)
#define ADC_JEXTSEL_TIM3_CC4    (4 << 16)
#define ADC_JEXTSEL_TIM4_TRGO   (5 << 16)
#define ADC_JEXTSEL_TIM4_CC1    (6 << 16)
#define ADC_JEXTSEL_TIM4_CC2    (7 << 16)
#define ADC_JEXTSEL_TIM4_CC3    (8 << 16)
#define ADC_JEXTSEL_TIM10_CC1   (9 << 16)
#define ADC_JEXTSEL_TIM7_TRGO   (10 << 16)
#define ADC_JEXTSEL_EXTI15      (15 << 16)
#define ADC_ALIGN               (1 << 11)
#define ADC_EOCS                (1 << 10)
#define ADC_DDS                 (1 << 9)
#define ADC_DMA                 (1 << 8)
#define ADC_DELS_NO_DELAY       (0 << 4)
#define ADC_DELS_UNTIL_READ     (1 << 4)
#define ADC_DELS_7              (2 << 4)
#define ADC_DELS_15             (3 << 4)
#define ADC_DELS_31             (4 << 4)
#define ADC_DELS_63             (5 << 4)
#define ADC_DELS_127            (6 << 4)
#define ADC_DELS_255            (7 << 4)
#define ADC_CFG                 (1 << 2)
#define ADC_CONT                (1 << 1)
#define ADC_ADON                (1 << 0)

// ADC_SMPR1, ADC_SMPR2, ADC_SMPR3, ADC_SMPR0
#define ADC_SMP_4CYCLES(n)      (0 << (3 * (n)))
#define ADC_SMP_9CYCLES(n)      (1 << (3 * (n)))
#define ADC_SMP_16CYCLES(n)     (2 << (3 * (n)))
#define ADC_SMP_24CYCLES(n)     (3 << (3 * (n)))
#define ADC_SMP_48CYCLES(n)     (4 << (3 * (n)))
#define ADC_SMP_96CYCLES(n)     (5 << (3 * (n)))
#define ADC_SMP_192CYCLES(n)    (6 << (3 * (n)))
#define ADC_SMP_384CYCLES(n)    (7 << (3 * (n)))

// ADC_SQR1
#define ADC_L(n)                ((n) << 20)
#define ADC_SQ28(n)             ((n) << 15)
#define ADC_SQ27(n)             ((n) << 10)
#define ADC_SQ26(n)             ((n) << 5)
#define ADC_SQ25(n)             ((n) << 0)

// ADC_SQR2
#define ADC_SQ24(n)             ((n) << 26)
#define ADC_SQ23(n)             ((n) << 20)
#define ADC_SQ22(n)             ((n) << 15)
#define ADC_SQ21(n)             ((n) << 10)
#define ADC_SQ20(n)             ((n) << 5)
#define ADC_SQ19(n)             ((n) << 0)

// ADC_SQR3
#define ADC_SQ18(n)             ((n) << 25)
#define ADC_SQ17(n)             ((n) << 20)
#define ADC_SQ16(n)             ((n) << 15)
#define ADC_SQ15(n)             ((n) << 10)
#define ADC_SQ14(n)             ((n) << 5)
#define ADC_SQ13(n)             ((n) << 0)

// ADC_SQR4
#define ADC_SQ12(n)             ((n) << 26)
#define ADC_SQ11(n)             ((n) << 20)
#define ADC_SQ10(n)             ((n) << 15)
#define ADC_SQ9(n)              ((n) << 10)
#define ADC_SQ8(n)              ((n) << 5)
#define ADC_SQ7(n)              ((n) << 0)

