institute-mpsu-miet/uos_embedded/runtime/cortex-m/io-stm32l.h
// ADC_SQR5
#define ADC_SQ6(n)              ((n) << 25)
#define ADC_SQ5(n)              ((n) << 20)
#define ADC_SQ4(n)              ((n) << 15)
#define ADC_SQ3(n)              ((n) << 10)
#define ADC_SQ2(n)              ((n) << 5)
#define ADC_SQ1(n)              ((n) << 0)

// ADC_JSQR
#define ADC_JL(n)               ((n) << 20)
#define ADC_JSQ4(n)             ((n) << 15)
#define ADC_JSQ3(n)             ((n) << 10)
#define ADC_JSQ2(n)             ((n) << 5)
#define ADC_JSQ1(n)             ((n) << 0)

// ADC_CSR
#define ADC_ADONS1              (1 << 6)
#define ADC_OVR1                (1 << 5)
#define ADC_STRT1               (1 << 4)
#define ADC_JSTRT1              (1 << 3)
#define ADC_JEOC1               (1 << 2)
#define ADC_EOC1                (1 << 1)
#define ADC_AWD1                (1 << 0)

// ADC_CSR
#define ADC_ADONS1              (1 << 6)
#define ADC_OVR1                (1 << 5)
#define ADC_STRT1               (1 << 4)
#define ADC_JSTRT1              (1 << 3)
#define ADC_JEOC1               (1 << 2)
#define ADC_EOC1                (1 << 1)
#define ADC_AWD1                (1 << 0)

// ADC_CCR
#define ADC_TSVREFE             (1 << 23)
#define ADC_HSI_DIV_1           (0 << 16)
#define ADC_HSI_DIV_2           (1 << 16)
#define ADC_HSI_DIV_4           (2 << 16)


/////////////////////////////////////////
// DAC
/////////////////////////////////////////
typedef struct
{
    arm_reg_t CR;       // control
    arm_reg_t SWTRIGR;  // software trigger
    arm_reg_t DHR12R1;  // channel1 12-bit right-aligned data
    arm_reg_t DHR12L1;  // channel1 12-bit left aligned data
    arm_reg_t DHR8R1;   // channel1 8-bit right aligned data
    arm_reg_t DHR12R2;  // channel2 12-bit right aligned data
    arm_reg_t DHR12L2;  // channel2 12-bit left aligned data
    arm_reg_t DHR8R2;   // channel2 8-bit right-aligned data
    arm_reg_t DHR12RD;  // dual DAC 12-bit right-aligned data
    arm_reg_t DHR12LD;  // dual DAC 12-bit left aligned data
    arm_reg_t DHR8RD;   // dual DAC 8-bit right aligned data
    arm_reg_t DOR1;     // channel1 data output
    arm_reg_t DOR2;     // channel2 data output
    arm_reg_t SR;       // status
} DAC_t;

#define DAC   ((DAC_t*) STM_DAC_BASE)

// DAC_CR values
#define DMA_DMAUDRIE2           (1 << 29)
#define DMA_DMAEN2              (1 << 28)
#define DMA_MAMP2(n)            ((n) << 24)
#define DMA_WAVE2(n)            ((n) << 22)
#define DMA_TSEL2(n)            ((n) << 19)
#define DMA_TEN2                (1 << 18)
#define DMA_BOFF2               (1 << 17)
#define DMA_EN2                 (1 << 16)
#define DMA_DMAUDRIE1           (1 << 13)
#define DMA_DMAEN1              (1 << 12)
#define DMA_MAMP1(n)            ((n) << 8)
#define DMA_WAVE1(n)            ((n) << 6)
#define DMA_TSEL1(n)            ((n) << 3)
#define DMA_TEN1                (1 << 2)
#define DMA_BOFF1               (1 << 1)
#define DMA_EN1                 (1 << 0)

// DAC_SWTRIGR values
#define DAC_SWTRIG2             (1 << 1)
#define DAC_SWTRIG1             (1 << 0)

// DAC_SR values
#define DAC_DMAUDR2             (1 << 29)
#define DAC_DMAUDR1             (1 << 13)


/////////////////////////////////////////
// Comparators (COMP)
/////////////////////////////////////////
typedef struct
{
    arm_reg_t CSR;      // control and status
} COMP_t;

#define COMP   ((COMP_t*) STM_COMP_BASE)

// COMP_CSR values
#define COMP_TSUSP                  (1 << 31)
#define COMP_CAIF                   (1 << 30)
#define COMP_CAIE                   (1 << 29)
#define COMP_RCH13                  (1 << 28)
#define COMP_FCH8                   (1 << 27)
#define COMP_FCH3                   (1 << 26)
#define COMP_OUTSEL_TIM2_INP_CAP4   (0 << 21)
#define COMP_OUTSEL_TIM2_OCREF_CLR  (1 << 21)
#define COMP_OUTSEL_TIM3_INP_CAP4   (2 << 21)
#define COMP_OUTSEL_TIM3_OCREF_CLR  (3 << 21)
#define COMP_OUTSEL_TIM4_INP_CAP4   (4 << 21)
#define COMP_OUTSEL_TIM4_OCREF_CLR  (5 << 21)
#define COMP_OUTSEL_TIM10_INP_CAP1  (6 << 21)
#define COMP_OUTSEL_NO_REDIR        (7 << 21)
#define COMP_INSEL_NO_SEL           (0 << 18)
#define COMP_INSEL_EXT_IO           (1 << 18)
#define COMP_INSEL_VREFINT          (2 << 18)
#define COMP_INSEL_3_4_VREFINT      (3 << 18)
#define COMP_INSEL_1_2_VREFINT      (4 << 18)
#define COMP_INSEL_1_4_VREFINT      (5 << 18)
#define COMP_INSEL_DAC_OUT1         (6 << 18)
#define COMP_INSEL_DAC_OUT2         (7 << 18)
#define COMP_INSEL_MASK			        (7 << 18)
#define COMP_WNDWE                  (1 << 17)
#define COMP_VREFOUTEN              (1 << 16)
#define COMP_CMP2OUT                (1 << 13)
#define COMP_SPEED                  (1 << 12)
#define COMP_CMP1OUT                (1 << 7)
#define COMP_SW1                    (1 << 5)
#define COMP_CMP1EN                 (1 << 4)
#define COMP_400KPD                 (1 << 3)
#define COMP_10KPD                  (1 << 2)
#define COMP_400KPU                 (1 << 1)
#define COMP_10KPU                  (1 << 0)

/////////////////////////////////////////
// Routing Interface (RI)
/////////////////////////////////////////
typedef struct
{
  arm_reg_t ICR;       // input capture register,                           Address offset: 0x04
  arm_reg_t ASCR1;     // analog switches control register,                 Address offset: 0x08
  arm_reg_t ASCR2;     // analog switch control register 2,                 Address offset: 0x0C
  arm_reg_t HYSCR1;    // hysteresis control register 1,                    Address offset: 0x10
  arm_reg_t HYSCR2;    // Hysteresis control register 2,                    Address offset: 0x14
  arm_reg_t HYSCR3;    // Hysteresis control register 3,                    Address offset: 0x18
  arm_reg_t HYSCR4;    // Hysteresis control register 4,                    Address offset: 0x1C
  arm_reg_t ASMR1;     // Analog switch mode register 1,                    Address offset: 0x20
  arm_reg_t CMR1;      // Channel mask register 1,                          Address offset: 0x24
  arm_reg_t CICR1;     // Channel identification for capture register 1,    Address offset: 0x28
  arm_reg_t ASMR2;     // Analog switch mode register 2,                    Address offset: 0x2C
  arm_reg_t CMR2;      // Channel mask register 2,                          Address offset: 0x30
  arm_reg_t CICR2;     // Channel identification for capture register 2,    Address offset: 0x34
  arm_reg_t ASMR3;     // Analog switch mode register 3,                    Address offset: 0x38
  arm_reg_t CMR3;      // Channel mask register 3,                          Address offset: 0x3C
  arm_reg_t CICR3;     // Channel identification for capture register3 ,    Address offset: 0x40
  arm_reg_t ASMR4;     // Analog switch mode register 4,                    Address offset: 0x44
  arm_reg_t CMR4;      // Channel mask register 4,                          Address offset: 0x48
  arm_reg_t CICR4;     // Channel identification for capture register 4,    Address offset: 0x4C
  arm_reg_t ASMR5;     // Analog switch mode register 5,                    Address offset: 0x50
  arm_reg_t CMR5;      // Channel mask register 5,                          Address offset: 0x54
  arm_reg_t CICR5;     // Channel identification for capture register 5,    Address offset: 0x58
} RI_t;

#define   RI      ((RI_t *) STM_RI_BASE)

//RI_ICR
#define   RI_IC4                            (1 << 21)
#define   RI_IC3                            (1 << 20)
#define   RI_IC2                            (1 << 19)
#define   RI_IC1                            (1 << 18)

#define   RI_TIM_NONE                       (0 << 16)
#define   RI_TIM2                           (1 << 16)
#define   RI_TIM3                           (2 << 16)
#define   RI_TIM4                           (3 << 16)
#define   RI_TIM_MASK                       (3 << 16)

