institute-mpsu-miet/uos_embedded/runtime/cortex-m/io-stm32l.h
//RI_ASMR3
#define   RI_ASM_PC(n)                      (1 << n)

//RI_CMR3
#define   RI_CMR_PC(n)                      (1 << n)

//RI_CICR3
#define   RI_CICR_PC(n)                     (1 << n)

//RI_ASMR4
#define   RI_ASM_PF(n)                      (1 << n)

//RI_CMR4
#define   RI_CMR_PF(n)                      (1 << n)

//RI_CICR4
#define   RI_CICR_PF(n)                     (1 << n)

//RI_ASMR5
#define   RI_ASM_PG(n)                      (1 << n)

//RI_CMR5
#define   RI_CMR_PG(n)                      (1 << n)

//RI_CICR5
#define   RI_CICR_PG(n)                     (1 << n)

/////////////////////////////////////////
// RTC
/////////////////////////////////////////
typedef struct
{
    arm_reg_t TR;       // Time
    arm_reg_t DR;       // Date
    arm_reg_t CR;       // Control
    arm_reg_t ISR;      // Initialization and status
    arm_reg_t PRER;     // Prescaler
    arm_reg_t WUTR;     // Wakeup timer
    arm_reg_t CALIBR;   // Calibration
    arm_reg_t ALRMAR;   // Alarm A
    arm_reg_t ALRMBR;   // Alarm B
    arm_reg_t WPR;      // Write protection
    arm_reg_t SSR;      // Sub second
    arm_reg_t SHIFTR;   // Shift control
    arm_reg_t TSTR;     // Time stamp time
    arm_reg_t TSDR;     // Time stamp date
    arm_reg_t TSSSR;    // Timestamp sub second
    arm_reg_t CALR;     // Calibration
    arm_reg_t TAFCR;    // Tamper and alternate function configuration
    arm_reg_t ALRMASSR; // Alarm A sub second
    arm_reg_t ALRMBSSR; // Alarm B sub second
    arm_reg_t gap0;
    arm_reg_t BKPR[32]; // Backup registers
} RTC_t;

#define RTC   ((RTC_t*) STM_RTC_BKP_BASE)

// TR, TSTR values
#define RTC_PM          (1 << 22)
#define RTC_HT(x)       ((x) << 20)
#define RTC_GET_HT(r)   (((r) >> 20) & 0x3)
#define RTC_HU(x)       ((x) << 16)
#define RTC_GET_HU(r)   (((r) >> 16) & 0xF)
#define RTC_MNT(x)      ((x) << 12)
#define RTC_GET_MNT(r)  (((r) >> 12) & 0x7)
#define RTC_MNU(x)      ((x) << 8)
#define RTC_GET_MNU(r)  (((r) >> 8) & 0xF)
#define RTC_ST(x)       ((x) << 4)
#define RTC_GET_ST(r)   (((r) >> 4) & 0x7)
#define RTC_SU(x)       ((x))
#define RTC_GET_SU(r)   (((r)) & 0xF)

// DR, TSDR (low 16 bits) values
#define RTC_YT(x)       ((x) << 20)
#define RTC_GET_YT(r)   (((r) >> 20) & 0xF)
#define RTC_YU(x)       ((x) << 16)
#define RTC_GET_YU(r)   (((r) >> 16) & 0xF)
#define RTC_WDU(x)      ((x) << 13)
#define RTC_GET_WDU(r)  (((r) >> 13) & 0x7)
#define RTC_WDU_MON     1
#define RTC_WDU_TUE     2
#define RTC_WDU_WED     3
#define RTC_WDU_THU     4
#define RTC_WDU_FRI     5
#define RTC_WDU_SAT     6
#define RTC_WDU_SUN     7
#define RTC_MT          (1 << 12)
#define RTC_MU(x)       ((x) << 8)
#define RTC_GET_MU(r)   (((r) >> 8) & 0xF)
#define RTC_DT(x)       ((x) << 4)
#define RTC_GET_DT(r)   (((r) >> 4) & 0x3)
#define RTC_DU(x)       ((x))
#define RTC_GET_DU(r)   (((r)) & 0xF)

// CR values
#define RTC_COE         (1 << 23)
#define RTC_OSEL(x)     ((x) << 21)
#define RTC_POL         (1 << 20)
#define RTC_COSEL       (1 << 19)
#define RTC_BKP         (1 << 18)
#define RTC_SUB1H       (1 << 17)
#define RTC_ADD1H       (1 << 16)
#define RTC_TSIE        (1 << 15)
#define RTC_WUTIE       (1 << 14)
#define RTC_ALRBIE      (1 << 13)
#define RTC_ALRAIE      (1 << 12)
#define RTC_TSE         (1 << 11)
#define RTC_WUTE        (1 << 10)
#define RTC_ALRBE       (1 << 9)
#define RTC_ALRAE       (1 << 8)
#define RTC_DCE         (1 << 7)
#define RTC_FMT         (1 << 6)
#define RTC_BYPSHAD     (1 << 5)
#define RTC_REFCKON     (1 << 4)
#define RTC_TSEDGE      (1 << 3)
#define RTC_WUCKSEL_DIV16           0
#define RTC_WUCKSEL_DIV8            1
#define RTC_WUCKSEL_DIV4            2
#define RTC_WUCKSEL_DIV2            3
#define RTC_WUCKSEL_CK_SPRE         4
#define RTC_WUCKSEL_CK_SPRE_ADDED   6

// ISR values
#define RTC_RECALPF     (1 << 16)
#define RTC_TAMP3F      (1 << 15)
#define RTC_TAMP2F      (1 << 14)
#define RTC_TAMP1F      (1 << 13)
#define RTC_TSOVF       (1 << 12)
#define RTC_TSF         (1 << 11)
#define RTC_WUTF        (1 << 10)
#define RTC_ALRBF       (1 << 9)
#define RTC_ALRAF       (1 << 8)
#define RTC_INIT        (1 << 7)
#define RTC_INITF       (1 << 6)
#define RTC_RSF         (1 << 5)
#define RTC_INITS       (1 << 4)
#define RTC_SHPF        (1 << 3)
#define RTC_WUTWF       (1 << 2)
#define RTC_ALRBWF      (1 << 1)
#define RTC_ALRAWF      (1 << 0)

// PRER values
#define RTC_PREDIV_A(x) ((x) << 16)
#define RTC_PREDIV_S(x) ((x))

// CALIBR values
#define RTC_DCS         (1 << 7)
#define RTC_DC(x)       ((x))

// ALRMAR, ALRMBR values
#define RTC_ALRM_MSK4   (1 << 31)
#define RTC_ALRM_WDSEL  (1 << 30)
#define RTC_ALRM_DT(x)  ((x) << 28)
#define RTC_ALRM_DU(x)  ((x) << 24)
#define RTC_ALRM_MSK3   (1 << 23)
#define RTC_ALRM_PM     (1 << 22)
#define RTC_ALRM_HT(x)  ((x) << 20)
#define RTC_ALRM_HU(x)  ((x) << 16)
#define RTC_ALRM_MSK2   (1 << 15)
#define RTC_ALRM_MNT(x) ((x) << 12)
#define RTC_ALRM_MNU(x) ((x) << 8)
#define RTC_ALRM_MSK1   (1 << 7)
#define RTC_ALRM_ST(x)  ((x) << 4)
#define RTC_ALRM_SU(x)  ((x) << 0)

// SHIFTR values
#define RTC_ADD1S       (1 << 31)
#define RTC_SUBFS(x)    ((x) << 0)

// CALR values
#define RTC_CALP        (1 << 15)
#define RTC_CALW8       (1 << 14)
#define RTC_CALW16      (1 << 13)
#define RTC_CALM(x)     (x)

// TAFCR values
#define RTC_ALARMOUTTYPE    (1 << 18)
#define RTC_TAMPPUDIS       (1 << 15)
#define RTC_TAMPPRCH(x)     ((x) << 13)
#define RTC_TAMPFLT(x)      ((x) << 11)
#define RTC_TAMPFREQ(x)     ((x) << 8)
#define RTC_TAMPTS          (1 << 7)
#define RTC_TAMP3TRG        (1 << 6)
#define RTC_TAMP3E          (1 << 5)
#define RTC_TAMP2TRG        (1 << 4)
#define RTC_TAMP2E          (1 << 3)
#define RTC_TAMPIE          (1 << 2)
#define RTC_TAMP1TRG        (1 << 1)
#define RTC_TAMP1E          (1 << 0)

// ALRMASSR, ALRMASSR values
#define RTC_MASKSS(x)       ((x) << 24)
#define RTC_SS(x)           ((x) << 0)


/////////////////////////////////////////
// Independent watchdog (IWDG)
/////////////////////////////////////////
typedef struct
{
    arm_reg_t KR;       // Key
    arm_reg_t DR;       // Prescaler
    arm_reg_t RLR;      // Reload
    arm_reg_t SR;      // Status
} IWDG_t;

#define IWDG   ((IWDG_t*) STM_IWDG_BASE)

// IWDG_KR values
#define IWDG_ALIVE_KEY      0xAAAA
#define IWDG_ACCESS_KEY     0x5555
#define IWDG_START_KEY      0xCCCC

// IWDG_PR values
#define IWDG_PR_DIV_4       0
#define IWDG_PR_DIV_8       1
#define IWDG_PR_DIV_16      2
#define IWDG_PR_DIV_32      3
#define IWDG_PR_DIV_64      4
#define IWDG_PR_DIV_128     5
#define IWDG_PR_DIV_256     6

