institute-mpsu-miet/uos_embedded/runtime/cortex-m/io-stm32l.h
// IWDG_SR values
#define IWDG_RVU            (1 << 1)
#define IWDG_PVU            (1 << 0)


/////////////////////////////////////////
// Window watchdog (WWDG)
/////////////////////////////////////////
typedef struct
{
    arm_reg_t CR;       // Control
    arm_reg_t CFR;      // Configuration
    arm_reg_t ISR;      // Status
} WWDG_t;

#define WWDG   ((WWDG_t*) STM_WWDG_BASE)

// WWDG_CR values
#define WWDG_WDGA           (1 << 7)
#define WWDG_T(n)           (n)

// WWDG_CFR values
#define WWDG_EWI            (1 << 9)
#define WWDG_WDGTB_DIV_1    (0 << 7)
#define WWDG_WDGTB_DIV_2    (1 << 7)
#define WWDG_WDGTB_DIV_4    (2 << 7)
#define WWDG_WDGTB_DIV_8    (3 << 7)
#define WWDG_W(n)           (n)

// WWDG_SR values
#define WWDG_EWIF           (1 << 0)


/////////////////////////////////////////
// USB
/////////////////////////////////////////
typedef struct
{
    arm_reg_t EPR[8];       // Endpoint n registers
    arm_reg_t gap0[8];      // Reserved
    arm_reg_t CNTR;         // Control
    arm_reg_t ISTR;         // Interrupt status
    arm_reg_t FNR;          // Frame number
    arm_reg_t DADDR;        // Device address
    arm_reg_t BTABLE;       // Buffer table address (the value must be
                            // 8-byte aligned)
} USB_t;

// One item of USB buffer descriptor table. The table shall be an
// array of defined below structure placed somewhere in memory.
// Must be 8-byte aligned.
typedef struct
{
    arm_reg_t ADDR_TX;
    arm_reg_t COUNT_TX;
    arm_reg_t ADDR_RX;
    arm_reg_t COUNT_RX;
} USB_BTABLE_item_t;

#define USB                 ((USB_t*) STM_USB_DEV_FS_BASE)
#define USB_PACKET_BUF      ((volatile uint8_t *) STM_USB_DEV_FS_SRAM_BASE)
#define USB_PACKET_BUF_SZ   (512 * 2)

// USB_EPR[n] values
#define USB_CTR_RX              (1 << 15)
#define USB_DTOG_RX             (1 << 14)
#define USB_GET_DTOG_RX(r)      (((r) >> 14) & 1)
#define USB_STAT_RX_DISABLED    (0 << 12)
#define USB_STAT_RX_STALL       (1 << 12)
#define USB_STAT_RX_NAK         (2 << 12)
#define USB_STAT_RX_VALID       (3 << 12)
#define USB_STAT_RX_MASK        (3 << 12)
#define USB_SETUP               (1 << 11)
#define USB_EP_TYPE_BULK        (0 << 9)
#define USB_EP_TYPE_CONTROL     (1 << 9)
#define USB_EP_TYPE_ISO         (2 << 9)
#define USB_EP_TYPE_INTERRUPT   (3 << 9)
#define USB_EP_TYPE_MASK        (3 << 9)
#define USB_EP_TYPE_CTRL_INTR_MASK   (1 << 9)
#define USB_DBL_BUF             (1 << 8) // EP_KIND for BULK EP
#define USB_STATUS_OUT          (1 << 8) // EP_KING for CONTROL EP
#define USB_CTR_TX              (1 << 7)
#define USB_DTOG_TX             (1 << 6)
#define USB_GET_DTOG_TX(r)      (((r) >> 6) & 1)
#define USB_STAT_TX_DISABLED    (0 << 4)
#define USB_STAT_TX_STALL       (1 << 4)
#define USB_STAT_TX_NAK         (2 << 4)
#define USB_STAT_TX_VALID       (3 << 4)
#define USB_STAT_TX_MASK        (3 << 4)
#define USB_EA(x)               ((x) & 0xF)

#define USB_EPR_RW_MASK         0x070F

// BTABLE COUNT_RX values
#define USB_BL_SIZE             (1 << 15)
#define USB_NUM_BLOCK(x)        ((x) << 10)
#define USB_GET_COUNT_RX(x)     ((x) & 0x1FF)

// USB_CNTR values
#define USB_CTRM                (1 << 15)
#define USB_PMAOVRM             (1 << 14)
#define USB_ERRM                (1 << 13)
#define USB_WKUPM               (1 << 12)
#define USB_SUSPM               (1 << 11)
#define USB_RESETM              (1 << 10)
#define USB_SOFM                (1 << 9)
#define USB_ESOFM               (1 << 8)
#define USB_RESUME              (1 << 4)
#define USB_FSUSP               (1 << 3)
#define USB_LP_MODE             (1 << 2)
#define USB_PDWN                (1 << 1)
#define USB_FRES                (1 << 0)

// USB_ISTR values
#define USB_CTR                 (1 << 15)
#define USB_PMAOVR              (1 << 14)
#define USB_ERR                 (1 << 13)
#define USB_WKUP                (1 << 12)
#define USB_SUSP                (1 << 11)
#define USB_RESET               (1 << 10)
#define USB_SOF                 (1 << 9)
#define USB_ESOF                (1 << 8)
#define USB_DIR                 (1 << 4)
#define USB_GET_EP_ID(x)        ((x) & 0xF)

// USB_FNR values
#define USB_RXDP                (1 << 15)
#define USB_RXDM                (1 << 14)
#define USB_LCK                 (1 << 13)
#define USB_GET_LSOF(r)         (((r) >> 11) & 3)
#define USB_GET_FN(r)           ((r) & 0x7FF)

// USB_DADDR values
#define USB_EF                  (1 << 7)
#define USB_ADD(x)              (x)


/////////////////////////////////////////
// USART
/////////////////////////////////////////
typedef struct
{
    arm_reg_t SR;       // Status
    arm_reg_t DR;       // Data
    arm_reg_t BRR;      // Baud rate
    arm_reg_t CR1;      // Control 1
    arm_reg_t CR2;      // Control 2
    arm_reg_t CR3;      // Control 3
    arm_reg_t GTPR;     // Guard time and prescaler
} USART_t;

#define USART1   ((USART_t*) STM_USART1_BASE)
#define USART2   ((USART_t*) STM_USART2_BASE)
#define USART3   ((USART_t*) STM_USART3_BASE)
#define UART4    ((USART_t*) STM_UART4_BASE)
#define UART5    ((USART_t*) STM_UART5_BASE)
#define USART6   ((USART_t*) STM_USART6_BASE)

// SR values
#define USART_CTS           (1 << 9)
#define USART_LBD           (1 << 8)
#define USART_TXE           (1 << 7)
#define USART_TC            (1 << 6)
#define USART_RXNE          (1 << 5)
#define USART_IDLE          (1 << 4)
#define USART_ORE           (1 << 3)
#define USART_NF            (1 << 2)
#define USART_FE            (1 << 1)
#define USART_PE            (1 << 0)

// BRR values
#define USART_DIV_MANTISSA(n)   ((n) << 4)
#define USART_DIV_FRACTION(n)   (n)

// CR1 values
#define USART_OVER8         (1 << 15)
#define USART_UE            (1 << 13)
#define USART_M             (1 << 12)
#define USART_WAKE          (1 << 11)
#define USART_PCE           (1 << 10)
#define USART_PS            (1 << 9)
#define USART_PEIE          (1 << 8)
#define USART_TXEIE         (1 << 7)
#define USART_TCIE          (1 << 6)
#define USART_RXNEIE        (1 << 5)
#define USART_IDLEIE        (1 << 4)
#define USART_TE            (1 << 3)
#define USART_RE            (1 << 2)
#define USART_RWU           (1 << 1)
#define USART_SBK           (1 << 0)

// CR2 values
#define USART_LINEN         (1 << 14)
#define USART_STOP_1        (0 << 12)
#define USART_STOP_05       (1 << 12)
#define USART_STOP_2        (2 << 12)
#define USART_STOP_15       (3 << 12)
#define USART_STOP_MASK     (3 << 12)
#define USART_CLKEN         (1 << 11)
#define USART_CPOL          (1 << 10)
#define USART_CPHA          (1 << 9)
#define USART_LBCL          (1 << 8)
#define USART_LBDIE         (1 << 6)
#define USART_LBDL          (1 << 5)
#define USART_ADD(n)        (n)

